stm32duino/LSM6DSV16X/src/lsm6dsv16x_reg.h
typedef enum {
  LSM6DSV16X_BYPASS_MODE             = 0x0,
  LSM6DSV16X_FIFO_MODE               = 0x1,
  LSM6DSV16X_STREAM_WTM_TO_FULL_MODE = 0x2,
  LSM6DSV16X_STREAM_TO_FIFO_MODE     = 0x3,
  LSM6DSV16X_BYPASS_TO_STREAM_MODE   = 0x4,
  LSM6DSV16X_STREAM_MODE             = 0x6,
  LSM6DSV16X_BYPASS_TO_FIFO_MODE     = 0x7,
} lsm6dsv16x_fifo_mode_t;
int32_t lsm6dsv16x_fifo_mode_set(stmdev_ctx_t *ctx, lsm6dsv16x_fifo_mode_t val);
int32_t lsm6dsv16x_fifo_mode_get(stmdev_ctx_t *ctx,
                                 lsm6dsv16x_fifo_mode_t *val);

int32_t lsm6dsv16x_fifo_gy_eis_batch_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_fifo_gy_eis_batch_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSV16X_TEMP_NOT_BATCHED       = 0x0,
  LSM6DSV16X_TEMP_BATCHED_AT_1Hz875 = 0x1,
  LSM6DSV16X_TEMP_BATCHED_AT_15Hz   = 0x2,
  LSM6DSV16X_TEMP_BATCHED_AT_60Hz   = 0x3,
} lsm6dsv16x_fifo_temp_batch_t;
int32_t lsm6dsv16x_fifo_temp_batch_set(stmdev_ctx_t *ctx,
                                       lsm6dsv16x_fifo_temp_batch_t val);
int32_t lsm6dsv16x_fifo_temp_batch_get(stmdev_ctx_t *ctx,
                                       lsm6dsv16x_fifo_temp_batch_t *val);

typedef enum {
  LSM6DSV16X_TMSTMP_NOT_BATCHED = 0x0,
  LSM6DSV16X_TMSTMP_DEC_1       = 0x1,
  LSM6DSV16X_TMSTMP_DEC_8       = 0x2,
  LSM6DSV16X_TMSTMP_DEC_32      = 0x3,
} lsm6dsv16x_fifo_timestamp_batch_t;
int32_t lsm6dsv16x_fifo_timestamp_batch_set(stmdev_ctx_t *ctx,
                                            lsm6dsv16x_fifo_timestamp_batch_t val);
int32_t lsm6dsv16x_fifo_timestamp_batch_get(stmdev_ctx_t *ctx,
                                            lsm6dsv16x_fifo_timestamp_batch_t *val);

int32_t lsm6dsv16x_fifo_batch_counter_threshold_set(stmdev_ctx_t *ctx,
                                                    uint16_t val);
int32_t lsm6dsv16x_fifo_batch_counter_threshold_get(stmdev_ctx_t *ctx,
                                                    uint16_t *val);

typedef enum {
  LSM6DSV16X_XL_BATCH_EVENT     = 0x0,
  LSM6DSV16X_GY_BATCH_EVENT     = 0x1,
  LSM6DSV16X_GY_EIS_BATCH_EVENT = 0x2,
} lsm6dsv16x_fifo_batch_cnt_event_t;
int32_t lsm6dsv16x_fifo_batch_cnt_event_set(stmdev_ctx_t *ctx,
                                            lsm6dsv16x_fifo_batch_cnt_event_t val);
int32_t lsm6dsv16x_fifo_batch_cnt_event_get(stmdev_ctx_t *ctx,
                                            lsm6dsv16x_fifo_batch_cnt_event_t *val);

typedef struct {
  uint16_t fifo_level          : 9;
  uint8_t fifo_bdr             : 1;
  uint8_t fifo_full            : 1;
  uint8_t fifo_ovr             : 1;
  uint8_t fifo_th              : 1;
} lsm6dsv16x_fifo_status_t;

int32_t lsm6dsv16x_fifo_status_get(stmdev_ctx_t *ctx,
                                   lsm6dsv16x_fifo_status_t *val);

typedef struct {
  enum {
    LSM6DSV16X_FIFO_EMPTY                    = 0x0,
    LSM6DSV16X_GY_NC_TAG                     = 0x1,
    LSM6DSV16X_XL_NC_TAG                     = 0x2,
    LSM6DSV16X_TEMPERATURE_TAG               = 0x3,
    LSM6DSV16X_TIMESTAMP_TAG                 = 0x4,
    LSM6DSV16X_CFG_CHANGE_TAG                = 0x5,
    LSM6DSV16X_XL_NC_T_2_TAG                 = 0x6,
    LSM6DSV16X_XL_NC_T_1_TAG                 = 0x7,
    LSM6DSV16X_XL_2XC_TAG                    = 0x8,
    LSM6DSV16X_XL_3XC_TAG                    = 0x9,
    LSM6DSV16X_GY_NC_T_2_TAG                 = 0xA,
    LSM6DSV16X_GY_NC_T_1_TAG                 = 0xB,
    LSM6DSV16X_GY_2XC_TAG                    = 0xC,
    LSM6DSV16X_GY_3XC_TAG                    = 0xD,
    LSM6DSV16X_SENSORHUB_SLAVE0_TAG          = 0xE,
    LSM6DSV16X_SENSORHUB_SLAVE1_TAG          = 0xF,
    LSM6DSV16X_SENSORHUB_SLAVE2_TAG          = 0x10,
    LSM6DSV16X_SENSORHUB_SLAVE3_TAG          = 0x11,
    LSM6DSV16X_STEP_COUNTER_TAG              = 0x12,
    LSM6DSV16X_SFLP_GAME_ROTATION_VECTOR_TAG = 0x13,
    LSM6DSV16X_SFLP_GYROSCOPE_BIAS_TAG       = 0x16,
    LSM6DSV16X_SFLP_GRAVITY_VECTOR_TAG       = 0x17,
    LSM6DSV16X_SENSORHUB_NACK_TAG            = 0x19,
    LSM6DSV16X_MLC_RESULT_TAG                = 0x1A,
    LSM6DSV16X_MLC_FILTER                    = 0x1B,
    LSM6DSV16X_MLC_FEATURE                   = 0x1C,
    LSM6DSV16X_XL_DUAL_CORE                  = 0x1D,
    LSM6DSV16X_GY_ENHANCED_EIS               = 0x1E,
  } tag;
  uint8_t cnt;
  uint8_t data[6];
} lsm6dsv16x_fifo_out_raw_t;
int32_t lsm6dsv16x_fifo_out_raw_get(stmdev_ctx_t *ctx,
                                    lsm6dsv16x_fifo_out_raw_t *val);

int32_t lsm6dsv16x_fifo_stpcnt_batch_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_fifo_stpcnt_batch_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16x_fifo_mlc_batch_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_fifo_mlc_batch_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16x_fifo_mlc_filt_batch_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_fifo_mlc_filt_batch_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16x_fifo_sh_batch_slave_set(stmdev_ctx_t *ctx, uint8_t idx, uint8_t val);
int32_t lsm6dsv16x_fifo_sh_batch_slave_get(stmdev_ctx_t *ctx, uint8_t idx, uint8_t *val);

typedef struct {
  uint8_t game_rotation        : 1;
  uint8_t gravity              : 1;
  uint8_t gbias                : 1;
} lsm6dsv16x_fifo_sflp_raw_t;
int32_t lsm6dsv16x_fifo_sflp_batch_set(stmdev_ctx_t *ctx,
                                       lsm6dsv16x_fifo_sflp_raw_t val);
int32_t lsm6dsv16x_fifo_sflp_batch_get(stmdev_ctx_t *ctx,
                                       lsm6dsv16x_fifo_sflp_raw_t *val);

typedef enum {
  LSM6DSV16X_AUTO          = 0x0,
  LSM6DSV16X_ALWAYS_ACTIVE = 0x1,
} lsm6dsv16x_filt_anti_spike_t;
int32_t lsm6dsv16x_filt_anti_spike_set(stmdev_ctx_t *ctx,
                                       lsm6dsv16x_filt_anti_spike_t val);
int32_t lsm6dsv16x_filt_anti_spike_get(stmdev_ctx_t *ctx,
                                       lsm6dsv16x_filt_anti_spike_t *val);

typedef struct {
  uint8_t drdy                 : 1;
  uint8_t ois_drdy             : 1;
  uint8_t irq_xl               : 1;
  uint8_t irq_g                : 1;
} lsm6dsv16x_filt_settling_mask_t;
