stm32duino/LSM6DSV16X/src/lsm6dsv16x_reg.h
typedef struct {
  uint8_t mlc1_src;
  uint8_t mlc2_src;
  uint8_t mlc3_src;
  uint8_t mlc4_src;
} lsm6dsv16x_mlc_out_t;
int32_t lsm6dsv16x_mlc_out_get(stmdev_ctx_t *ctx, lsm6dsv16x_mlc_out_t *val);

int32_t lsm6dsv16x_mlc_ext_sens_sensitivity_set(stmdev_ctx_t *ctx,
                                                uint16_t val);
int32_t lsm6dsv16x_mlc_ext_sens_sensitivity_get(stmdev_ctx_t *ctx,
                                                uint16_t *val);

typedef enum {
  LSM6DSV16X_OIS_CTRL_FROM_OIS = 0x0,
  LSM6DSV16X_OIS_CTRL_FROM_UI  = 0x1,
} lsm6dsv16x_ois_ctrl_mode_t;
int32_t lsm6dsv16x_ois_ctrl_mode_set(stmdev_ctx_t *ctx,
                                     lsm6dsv16x_ois_ctrl_mode_t val);
int32_t lsm6dsv16x_ois_ctrl_mode_get(stmdev_ctx_t *ctx,
                                     lsm6dsv16x_ois_ctrl_mode_t *val);

int32_t lsm6dsv16x_ois_reset_set(stmdev_ctx_t *ctx, int8_t val);
int32_t lsm6dsv16x_ois_reset_get(stmdev_ctx_t *ctx, int8_t *val);

int32_t lsm6dsv16x_ois_interface_pull_up_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_ois_interface_pull_up_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef struct {
  uint8_t ack                  : 1;
  uint8_t req                  : 1;
} lsm6dsv16x_ois_handshake_t;
int32_t lsm6dsv16x_ois_handshake_from_ui_set(stmdev_ctx_t *ctx,
                                             lsm6dsv16x_ois_handshake_t val);
int32_t lsm6dsv16x_ois_handshake_from_ui_get(stmdev_ctx_t *ctx,
                                             lsm6dsv16x_ois_handshake_t *val);
int32_t lsm6dsv16x_ois_handshake_from_ois_set(stmdev_ctx_t *ctx,
                                              lsm6dsv16x_ois_handshake_t val);
int32_t lsm6dsv16x_ois_handshake_from_ois_get(stmdev_ctx_t *ctx,
                                              lsm6dsv16x_ois_handshake_t *val);

int32_t lsm6dsv16x_ois_shared_set(stmdev_ctx_t *ctx, uint8_t val[6]);
int32_t lsm6dsv16x_ois_shared_get(stmdev_ctx_t *ctx, uint8_t val[6]);

int32_t lsm6dsv16x_ois_on_spi2_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_ois_on_spi2_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef struct {
  uint8_t gy                   : 1;
  uint8_t xl                   : 1;
} lsm6dsv16x_ois_chain_t;
int32_t lsm6dsv16x_ois_chain_set(stmdev_ctx_t *ctx, lsm6dsv16x_ois_chain_t val);
int32_t lsm6dsv16x_ois_chain_get(stmdev_ctx_t *ctx,
                                 lsm6dsv16x_ois_chain_t *val);

typedef enum {
  LSM6DSV16X_OIS_125dps  = 0x0,
  LSM6DSV16X_OIS_250dps  = 0x1,
  LSM6DSV16X_OIS_500dps  = 0x2,
  LSM6DSV16X_OIS_1000dps = 0x3,
  LSM6DSV16X_OIS_2000dps = 0x4,
} lsm6dsv16x_ois_gy_full_scale_t;
int32_t lsm6dsv16x_ois_gy_full_scale_set(stmdev_ctx_t *ctx,
                                         lsm6dsv16x_ois_gy_full_scale_t val);
int32_t lsm6dsv16x_ois_gy_full_scale_get(stmdev_ctx_t *ctx,
                                         lsm6dsv16x_ois_gy_full_scale_t *val);

typedef enum {
  LSM6DSV16X_OIS_2g  = 0x0,
  LSM6DSV16X_OIS_4g  = 0x1,
  LSM6DSV16X_OIS_8g  = 0x2,
  LSM6DSV16X_OIS_16g = 0x3,
} lsm6dsv16x_ois_xl_full_scale_t;
int32_t lsm6dsv16x_ois_xl_full_scale_set(stmdev_ctx_t *ctx,
                                         lsm6dsv16x_ois_xl_full_scale_t val);
int32_t lsm6dsv16x_ois_xl_full_scale_get(stmdev_ctx_t *ctx,
                                         lsm6dsv16x_ois_xl_full_scale_t *val);

typedef enum {
  LSM6DSV16X_DEG_80 = 0x0,
  LSM6DSV16X_DEG_70 = 0x1,
  LSM6DSV16X_DEG_60 = 0x2,
  LSM6DSV16X_DEG_50 = 0x3,
} lsm6dsv16x_6d_threshold_t;
int32_t lsm6dsv16x_6d_threshold_set(stmdev_ctx_t *ctx,
                                    lsm6dsv16x_6d_threshold_t val);
int32_t lsm6dsv16x_6d_threshold_get(stmdev_ctx_t *ctx,
                                    lsm6dsv16x_6d_threshold_t *val);

int32_t lsm6dsv16x_4d_mode_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_4d_mode_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSV16X_2400MOhm = 0x0,
  LSM6DSV16X_730MOhm = 0x1,
  LSM6DSV16X_300MOhm = 0x2,
  LSM6DSV16X_255MOhm = 0x3,
} lsm6dsv16x_ah_qvar_zin_t;
int32_t lsm6dsv16x_ah_qvar_zin_set(stmdev_ctx_t *ctx,
                                   lsm6dsv16x_ah_qvar_zin_t val);
int32_t lsm6dsv16x_ah_qvar_zin_get(stmdev_ctx_t *ctx,
                                   lsm6dsv16x_ah_qvar_zin_t *val);

typedef struct {
  uint8_t ah_qvar_en           : 1;
} lsm6dsv16x_ah_qvar_mode_t;
int32_t lsm6dsv16x_ah_qvar_mode_set(stmdev_ctx_t *ctx,
                                    lsm6dsv16x_ah_qvar_mode_t val);
int32_t lsm6dsv16x_ah_qvar_mode_get(stmdev_ctx_t *ctx,
                                    lsm6dsv16x_ah_qvar_mode_t *val);

typedef enum {
  LSM6DSV16X_SW_RST_DYN_ADDRESS_RST = 0x0,
  LSM6DSV16X_I3C_GLOBAL_RST         = 0x1,
} lsm6dsv16x_i3c_reset_mode_t;
int32_t lsm6dsv16x_i3c_reset_mode_set(stmdev_ctx_t *ctx,
                                      lsm6dsv16x_i3c_reset_mode_t val);
int32_t lsm6dsv16x_i3c_reset_mode_get(stmdev_ctx_t *ctx,
                                      lsm6dsv16x_i3c_reset_mode_t *val);

typedef enum {
  LSM6DSV16X_IBI_2us  = 0x0,
  LSM6DSV16X_IBI_50us = 0x1,
  LSM6DSV16X_IBI_1ms  = 0x2,
  LSM6DSV16X_IBI_25ms = 0x3,
} lsm6dsv16x_i3c_ibi_time_t;
int32_t lsm6dsv16x_i3c_ibi_time_set(stmdev_ctx_t *ctx,
                                    lsm6dsv16x_i3c_ibi_time_t val);
int32_t lsm6dsv16x_i3c_ibi_time_get(stmdev_ctx_t *ctx,
                                    lsm6dsv16x_i3c_ibi_time_t *val);

int32_t lsm6dsv16x_sh_master_interface_pull_up_set(stmdev_ctx_t *ctx,
                                                   uint8_t val);
int32_t lsm6dsv16x_sh_master_interface_pull_up_get(stmdev_ctx_t *ctx,
                                                   uint8_t *val);

int32_t lsm6dsv16x_sh_read_data_raw_get(stmdev_ctx_t *ctx, uint8_t *val,
                                        uint8_t len);

typedef enum {
  LSM6DSV16X_SLV_0       = 0x0,
  LSM6DSV16X_SLV_0_1     = 0x1,
  LSM6DSV16X_SLV_0_1_2   = 0x2,
  LSM6DSV16X_SLV_0_1_2_3 = 0x3,
} lsm6dsv16x_sh_slave_connected_t;
int32_t lsm6dsv16x_sh_slave_connected_set(stmdev_ctx_t *ctx,
                                          lsm6dsv16x_sh_slave_connected_t val);
int32_t lsm6dsv16x_sh_slave_connected_get(stmdev_ctx_t *ctx,
                                          lsm6dsv16x_sh_slave_connected_t *val);

int32_t lsm6dsv16x_sh_master_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_sh_master_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16x_sh_pass_through_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_sh_pass_through_get(stmdev_ctx_t *ctx, uint8_t *val);

